Revit 2027 API
Space.UnboundedHeight Property
Get the Unbounded Height of the Space.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double UnboundedHeight { get; }
Public ReadOnly Property UnboundedHeight As Double
	Get
public:
property double UnboundedHeight {
	double get ();
}
member UnboundedHeight : float with get
Property Value
Double
Remarks
This property is used to get the Unbounded Height of the Space.
See Also
Reference
Space Class
Autodesk.Revit.DB.Mechanical Namespace